# Параметр i приймає значення в діапазоні [0, 10)
for i in range(10):
    print('i =', i)
# Параметр i приймає значення в діапазоні [5, 10)
for i in range(5, 10):
    print('i =', i)
# Параметр i приймає значення в діапазоні [5, 10) з кроком 2
for i in range(5, 10, 2): print('i =', i)
# Цикл буде повторюватися 3 рази, якщо користувач не завершить його раніше
for i in range(3):
    response = input('Введіть stop, щоб зупинити цикл(інакше що завгодно): ')
    if response == 'stop':
      break
    else: # цю гілку виконують тільки якщо цикл не був перерваний
      print('Цикл сам був завершений')
print('Кінець програми')
# Функція reversed дозволяє обходити послідовність в зворотному напрямку
for i in reversed(range(5)): print(i)
