name = None # спочатку ми не знаємо імені користувача
# нескінчений цикл
while True:
 print('Меню:')
 print('1. Ввести ім‘я')
 print('2. Вивести привітання')
 print('3. Вийти')
 response = input('Виберіть пункт: ')
 print()
 if response == '1':
     name=input("Введіть ваше ім‘я: ")
 elif response=='2':
     if name: #вітаємося з користувачем, якщо ім'я вже введено
         print('Привіт, ', name, '!', sep='')
     else:
         print('Я не знаю вашого імені.')
 elif response=='3':
     #оператор break завершує виконання циклу
     break #якщо користувач вибрав 3, то виходимо з циклу
 else:
     print('Неправильне введення.')
 print()
