def function():
 # визначення локальної змінної
 var = 'локальна змінна'
 # виведення значення локальної змінної на екран
 print(var)
# визначення глобальної змінної
var = 'глобальна змінна'
function()
# виведення на екран значення глобальної змінної
print(var)

#Службове слово global вказує на необхідність отримати
#доступ до глобальної змінної var, а не створювати нову
#локальну під час спроби що-небудь їй присвоїти:
def function():
 global var
 # виведення значення глобальної змінної на екран
 print(var)
 # зміна глобальної змінної
 var = 'нове значення'
 # виведення значення глобальної змінної на екран
 print(var)
var = 'глобальна змінна'
function(); print(var)

def function(c, d):
 # a, b – глобальні змінні; c, d -- локальні
 global a, b
 # зміна значення глобальної змінної
 a = 5
 b = 7
 # зміна значення локальної змінної
 c = 10
 d = 12
a, b, c, d = 1, 2, 3, 4 # множинне присвоєння
print(a, b, c, d) # 1 2 3 4
function(c, d)
print(a, b, c, d) # 5 7 3 4
